---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ShearAreaWeakAxis
source: html/93517470-a8b5-0142-cb56-348ae2f48416.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ShearAreaWeakAxis Property

Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

## Syntax (C#)
```csharp
public double ShearAreaWeakAxis { get; set; }
```